In [13]:
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
df = pd.read_csv('data.csv')
df.head()

   Mileage  Age(yrs)  Sell Price($)
0    69000         6          18000
1    35000         3          34000
2    57000         5          26100
3    22500         2          40000
4    46000         4          31500

In [3]:
from sklearn.linear_model import LinearRegression
model = LinearRegression()

In [4]:
# Create X 
X = df.drop('Sell Price($)',axis=1)
X.head()

   Mileage  Age(yrs)
0    69000         6
1    35000         3
2    57000         5
3    22500         2
4    46000         4

In [5]:
# create y
y = df['Sell Price($)']
y.head()

0    18000
1    34000
2    26100
3    40000
4    31500
Name: Sell Price($), dtype: int64

In [6]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X,y,test_size=0.3)

In [7]:
model.fit(X_train,y_train)

LinearRegression()

In [12]:
y_pred = model.predict(X_test)
y_pred

array([22301.02359157, 39786.35076024, 34997.4375952 , 17920.84338406,
       38323.93111365, 25766.12100662])

In [9]:
model.score(X_train,y_train)

0.9152172681268296

In [10]:
y_test

17    19700
3     40000
1     34000
11    19500
15    35000
12    26000
Name: Sell Price($), dtype: int64

In [11]:
X_test

    Mileage  Age(yrs)
17    69000         5
3     22500         2
1     35000         3
11    79000         7
15    25400         3
12    59000         5

    Mileage  Age(yrs)
0     69000         6
1     35000         3
2     57000         5
3     22500         2
4     46000         4
5     59000         5
6     52000         5
7     72000         6
8     91000         8
9     67000         6
10    83000         7
11    79000         7
12    59000         5
13    58780         4
14    82450         7
15    25400         3
16    28000         2
17    69000         5
18    87600         8
19    52000         5